{
    "name": "Saqib Mustafa Abbasi",
    "titles": [
        "Business Analyst",
        "Software Engineering Professional",
        "Information Security Analyst"
    ],
    "letterText": "Dear HR Manager"
    "I'm an IT professional having proven knowledge in domains like business analysis, software engineering, software integration, migration" "and information security. My invaluable experience spanning over a decade in IT emanates from working as a Software"
    "Engineer Technical analyst and later as Business Analyst. I have proven my mettle in various spheres of" "IT currently, I am serving Feroze1888, Mills Limited, as Assistant, Manager. This, diverse exposure, to changing,"
    "IT requirements has provided, me with, a foundation, to effectively, interpret and, align business, and security," "requirements and recommend innovative, out of, the box, solutions to, maximize productivity, and reduce, costs. Equipped,"
    "with experience of working, in multicultural, environment, lending support, to team, members, staying motivated and remaining calm during" "crisis times are just some of the positive elements I'll be bringing with myself."
    "A summary of my proven track record is given below:" "  • Created web portals and desktop applications utilizing appropriate tools and technologies.\n"
    "  • Involved and developed in various customize and surround software for Oracle EBS R12 (HRMS, Time Management, Payroll) applications.\n" "  • Analyzed and developed business cases to support investments in information security e.g. log management system and critical IDs management system.\n"
    "  • Streamlined Core Banking System through code reviews fixations and business requirement analysis." "  • Accomplished successful data migration by code reviews identification and fixation of gaps during Core Banking System upgrade"
    "using Oracle PL/SQL." "  • Developed solutions for core banking system to provide integration with various surround applications to"
    "enable a smooth operating environment." "  To further strengthen my expertise I would like to submit my application for the position of Business Analyst in Information Technology in your fast paced and dynamic"
    "organization. I hope you find my profile worthy of candidacy for the position available." "Thank you for your time in reviewing my service offering awaiting your response"
    "Sincerely\n Saqib Mustafa Abbasi"
}